### **SOLVING LEETCODE SQL QUESTIONS INTO PANDAS**

### **Importing Necessary Library**

In [20]:
import pandas as pd
import numpy as np
import mysql.connector

#### **Connecting to the mysql**

In [42]:
import mysql.connector
import pandas as pd

def connecting_to_mysql(user, password, host, database_name, table_name):
    
    """
    Connects to a MySQL database and retrieves data from a specified table.

    Parameters:
    - user (str): The username for the MySQL database.
    - password (str): The password for the MySQL database.
    - host (str): The host where the MySQL database is located.
    - database_name (str): The name of the database to connect to.
    - table_name (str): The name of the table to query.

    Returns:
    - pd.DataFrame: DataFrame containing the data from the specified table.
    """
    
    try:
        # Database configuration
        config = {
            'user': user,
            'password': password,
            'host': host,
            'database': database_name
        }

        # Establish connection to the database
        conn = mysql.connector.connect(**config)

        # Define the SQL query
        query = f'SELECT * FROM {table_name}'

        # Execute the query and read the data into a DataFrame
        df = pd.read_sql(query, conn)
        
    except mysql.connector.Error as err:
        print(f"Error: {err}")
        df = pd.DataFrame()  # Return an empty DataFrame in case of error

    finally:
        # Close the database connection
        if conn.is_connected():
            conn.close()

    return df

#### **Q1.) Write the Pandas query to find the IDs of products that are both low fat and recyclable**

In [30]:
# Creating the data frame product
df_product = connecting_to_mysql('root','Sushant@123','localhost','leetcode','products')
df_product

C:\Users\DELL\AppData\Local\Temp\ipykernel_14884\2457519330.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query,conn)

   product_id low_fats recyclable
0           0        Y          N
1           1        Y          Y
2           2        N          Y
3           3        Y          Y
4           4        N          N

In [6]:
df_product

   product_id low_fats recyclable
0           0        Y          N
1           1        Y          Y
2           2        N          Y
3           3        Y          Y
4           4        N          N

In [8]:
result = df_product[(df_product['low_fats'] == 'Y') & (df_product['recyclable'] == 'Y')]
result

   product_id low_fats recyclable
1           1        Y          Y
3           3        Y          Y

In [13]:
result = result[['product_id']].reset_index(drop=True)
result

   product_id
0           1
1           3

#### **Q2.) Find the names of the customer that are not referred by the customer with id = 2.**

In [32]:
# Creating the data frame customer
df_customer = connecting_to_mysql('root','Sushant@123','localhost','leetcode','customer')
df_customer

C:\Users\DELL\AppData\Local\Temp\ipykernel_14884\2457519330.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query,conn)

   id  name  referee_id
0   1  Will         NaN
1   2  Jane         NaN
2   3  Alex         2.0
3   4  Bill         NaN
4   5  Zack         1.0
5   6  Mark         2.0

In [33]:
result = df_customer[(df_customer['referee_id'] != 2) | (df_customer['referee_id'] == np.nan)]
result

   id  name  referee_id
0   1  Will         NaN
1   2  Jane         NaN
3   4  Bill         NaN
4   5  Zack         1.0

In [34]:
result = result[['name']].reset_index(drop=True)
result

   name
0  Will
1  Jane
2  Bill
3  Zack

#### **Q3.)A country is big if:**
 - it has an area of at least three million (i.e., 3000000 km2), or
 - it has a population of at least twenty-five million (i.e., 25000000).
#### **Write a solution to find the name, population, and area of the big countries.**

In [35]:
df_world = connecting_to_mysql('root','Sushant@123','localhost','leetcode','world')
df_world

C:\Users\DELL\AppData\Local\Temp\ipykernel_14884\2457519330.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query,conn)

          name continent     area  population           gdp
0  Afghanistan      Asia   652230    25500100   20343000000
1      Albania    Europe    28748     2831741   12960000000
2      Algeria    Africa  2381741    37100000  188681000000
3      Andorra    Europe      468       78115    3712000000
4       Angola    Africa  1246700    20609294  100990000000

In [38]:
result = df_world[(df_world['area'] >= 3000000) | (df_world['population'] >= 25000000)]
result

          name continent     area  population           gdp
0  Afghanistan      Asia   652230    25500100   20343000000
2      Algeria    Africa  2381741    37100000  188681000000

In [41]:
result = result[['name','population','area']].reset_index(drop=True)
result

          name  population     area
0  Afghanistan    25500100   652230
1      Algeria    37100000  2381741

#### **Q4.) To find all authors who have viewed at least one of their own articles, you can use the following SQL query.**

In [43]:
df_view = connecting_to_mysql('root','Sushant@123','localhost','leetcode','views')
df_view

C:\Users\DELL\AppData\Local\Temp\ipykernel_14884\186283953.py:36: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

   article_id  author_id  viewer_id   view_date
0           1          3          5  2019-08-01
1           1          3          6  2019-08-02
2           2          7          7  2019-08-01
3           2          7          6  2019-08-02
4           4          7          1  2019-07-22
5           3          4          4  2019-07-21
6           3          4          4  2019-07-21

In [44]:
df_view.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   article_id  7 non-null      int64
 1   author_id   7 non-null      int64
 2   viewer_id   7 non-null      int64
 3   view_date   7 non-null      object
dtypes: int64(3), object(1)
memory usage: 356.0+ bytes

In [60]:
result  = df_view[(df_view['author_id'] == df_view['viewer_id'])].sort_values(by=['author_id'],ascending=True)
result

   article_id  author_id  viewer_id   view_date
5           3          4          4  2019-07-21
6           3          4          4  2019-07-21
2           2          7          7  2019-08-01

In [61]:
result_1 = result['author_id'].unique()
result_1

array([4, 7])

In [62]:
result_1 = pd.DataFrame(result_1,columns = ['id'])
result_1

   id
0   4
1   7

#### **Q5.) Write a solution to find the IDs of the invalid tweets. The tweet is invalid ,if the number of characters used in the content of the tweet is strictly greater than 15.**

In [63]:
df_tweet = connecting_to_mysql('root','Sushant@123','localhost','leetcode','tweets')
df_tweet

C:\Users\DELL\AppData\Local\Temp\ipykernel_14884\186283953.py:36: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

   tweet_id                           content
0         1                    Vote for Biden
1         2  Let us make America great again!

In [65]:
(df_tweet['content'])

0                      Vote for Biden
1    Let us make America great again!
Name: content, dtype: object

In [67]:
result = df_tweet[(df_tweet['content'].apply(lambda x:len(x)>15))]
result

   tweet_id                           content
1         2  Let us make America great again!

In [70]:
result = result[['tweet_id']].reset_index(drop=True)
result

   tweet_id
0         2

#### **Q6.) Write a solution to show the unique ID of each user, If a user does not have a unique ID replace just show null.**

In [71]:
df_employee = connecting_to_mysql('root','Sushant@123','localhost','leetcode','employees')
df_employeeuni = connecting_to_mysql('root','Sushant@123','localhost','leetcode','employeeuni')

C:\Users\DELL\AppData\Local\Temp\ipykernel_14884\186283953.py:36: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

In [72]:
df_employee

   id      name
0   1     Alice
1   3  Jonathan
2   7       Bob
3  11      Meir
4  90   Winston

In [73]:
df_employeeuni

   id  unique_id
0   3          1
1  11          2
2  90          3

In [79]:
result = pd.merge(left=df_employee,right=df_employeeuni,how='left',on='id').sort_values(by=['unique_id'],ascending=True)
result

   id      name  unique_id
1   3  Jonathan        1.0
3  11      Meir        2.0
4  90   Winston        3.0
0   1     Alice        NaN
2   7       Bob        NaN

In [80]:
result = result[['name','unique_id']].reset_index(drop=True)
result

       name  unique_id
0  Jonathan        1.0
1      Meir        2.0
2   Winston        3.0
3     Alice        NaN
4       Bob        NaN

#### **Q7.) Write a solution to report the product_name, year, and price for each sale_id in the Sales table.**

In [81]:
df_products = connecting_to_mysql('root','Sushant@123','localhost','leetcode','product')
df_sales = connecting_to_mysql('root','Sushant@123','localhost','leetcode','sales')

C:\Users\DELL\AppData\Local\Temp\ipykernel_14884\186283953.py:36: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

In [82]:
df_products

   product_id product_name
0         100        Nokia
1         200        Apple
2         300      Samsung

In [83]:
df_sales

   sale_id  product_id  year  quantity  price
0        1         100  2008        10   5000
1        2         100  2009        12   5000
2        7         200  2011        15   9000

In [84]:
result = pd.merge(left=df_products,right=df_sales,how='inner',on='product_id')
result

   product_id product_name  sale_id  year  quantity  price
0         100        Nokia        1  2008        10   5000
1         100        Nokia        2  2009        12   5000
2         200        Apple        7  2011        15   9000

In [85]:
result = result[['product_name','year','price']].reset_index(drop=True)
result

  product_name  year  price
0        Nokia  2008   5000
1        Nokia  2009   5000
2        Apple  2011   9000

#### **Q8.) Write a solution to find the IDs of the users who visited without making any transactions and the number of times they made these types of visits**

In [86]:
df_visits = connecting_to_mysql('root','Sushant@123','localhost','leetcode','visits')
df_transactions = connecting_to_mysql('root','Sushant@123','localhost','leetcode','transactions')

C:\Users\DELL\AppData\Local\Temp\ipykernel_14884\186283953.py:36: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

In [87]:
df_visits

   visit_id  customer_id
0         1           23
1         2            9
2         4           30
3         5           54
4         6           96
5         7           54
6         8           54

In [88]:
df_transactions

   transaction_id  visit_id  amount
0               2         5     310
1               3         5     300
2               9         5     200
3              12         1     910
4              13         2     970

In [89]:
df = pd.merge(left=df_visits,right=df_transactions,how='left',on='visit_id')
df

   visit_id  customer_id  transaction_id  amount
0         1           23            12.0   910.0
1         2            9            13.0   970.0
2         4           30             NaN     NaN
3         5           54             2.0   310.0
4         5           54             3.0   300.0
5         5           54             9.0   200.0
6         6           96             NaN     NaN
7         7           54             NaN     NaN
8         8           54             NaN     NaN

In [97]:
filter_tran_nan = df[df['transaction_id'].isna()]
filter_tran_nan

   visit_id  customer_id  transaction_id  amount
2         4           30             NaN     NaN
6         6           96             NaN     NaN
7         7           54             NaN     NaN
8         8           54             NaN     NaN

In [102]:
result = filter_tran_nan.groupby('customer_id',as_index=False).agg(count_no_tran = ('customer_id','count'))
result

   customer_id  count_no_tran
0           30              1
1           54              2
2           96              1